social-flow-backend/testing/performance/artillery/scripts/baseline-api.yml
config:
  target: "{{ baseUrl }}"
  processor: "./helpers/fixtures.js"
  phases:
    - duration: "{{ duration }}"
      arrivalRate: 10
      rampTo: "{{ vus }}"
  variables:
    samplePath: "{{ storageSampleFile }}"
  http:
    pool: 200
  defaults:
    headers:
      Accept: "application/json"
scenarios:
  - name: "Baseline API - mix of read/write endpoints"
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
      - get:
          url: "/metrics/summary"
          expect:
            - statusCode: 200
      - post:
          url: "/items"
          json:
            name: "perf-item-{{ $loopingIndex }}-{{ $timestamp }}"
            description: "Generated by Artillery baseline scenario"
          expect:
            - statusCode: 201
      - get:
          url: "/items/{{ randomItemId }}"
          expect:
            - statusCode: [200, 404] # tolerate not-found
  - name: "Baseline read-heavy"
    weight: 2
    flow:
      - get:
          url: "/items"
          qs:
            limit: 20
          expect:
            - statusCode: 200

ensure:
  - match: "$.summary.codes.5xx"
    comparator: "<="
    expected: 0
  - match: "$.summary.http.requests.pct95"
    comparator: "<"
    expected: 1000