social-flow-backend/testing/performance/artillery/scripts/storage-download.yml
config:
  target: "{{ baseUrl }}"
  processor: "./helpers/fixtures.js"
  phases:
    - duration: "{{ duration }}"
      arrivalRate: 5
      rampTo: "{{ vus }}"
scenarios:
  - name: "Storage - download stress (presigned URLs)"
    flow:
      - get:
          url: "/storage/presigned?key=uploads/sample.txt"
          expect:
            - statusCode: 200
          capture:
            - json: "$.url"
              as: "presignedUrl"
      - get:
          # direct fetch of presigned asset
          url: "{{ presignedUrl }}"
          expect:
            - statusCode: 200
  - name: "Storage - download via API proxy"
    weight: 1
    flow:
      - get:
          url: "/storage/download?key=uploads/sample.txt"
          expect:
            - statusCode: 200

ensure:
  - match: "$.summary.codes.5xx"
    comparator: "<="
    expected: 0