social-flow-backend/testing/performance/artillery/scripts/storage-upload.yml
config:
  target: "{{ baseUrl }}"
  processor: "./helpers/result-processor.js"
  phases:
    - duration: "{{ duration }}"
      arrivalRate: 2
      rampTo: "{{ vus }}"
  payload:
    # optional, can be used for variable file lists in big runs
  defaults:
    headers:
      # multipart handled in JS hook
      Accept: "application/json"
scenarios:
  - name: "Storage - multipart upload stress"
    flow:
      - function: "prepareMultipartUpload"       # sets uploadUrl or form fields
      - function: "multipartUploadFile"         # performs multipart using node-fetch + formdata
      - post:
          # fallback: call the /storage/upload endpoint if we only post JSON with presigned url
          url: "/storage/upload"
          json:
            key: "{{ uploadKey }}"
          expect:
            - statusCode: [200,201]
ensure:
  - match: "$.summary.codes.5xx"
    comparator: "<="
    expected: 1
  - match: "$.summary.latency.mean"
    comparator: "<"
    expected: 2000